Repository: Digital-Archeology/Chemtool
Catalog: po/*.po
Languages: cs

source: The current drawing is not saved ! Do you really wish to continue ?
cs: Souèasný vzorec není ulo¾en! Opravdu si pøejete pokraèovat?

source: Yes
cs: Ano

source: No
cs: Ne

source: File %s already exists ! Overwrite it ?
cs: Soubor %s ji¾ existuje! Pøepsat?

source: Next ring drawn will have %d sides
cs: Pøí¹tí kruh bude mít %d stran

source: Imported %d bonds and %d labels
cs: Importováno %d vazeb a %d popisek

source: unnamed
cs: nepojmenovany

source: Ready
cs: Hotovo

source: Helper process failed - %s %s %s %s!
cs: Pomocný program selhal - %s %s %s %s!

source: Drawing printed!
cs: Tisk proveden!

source: Failed to print drawing !
cs: Vzorec nebyl vyti¹tìn!

source: invalid angle mode %d
cs: chybný mód úhlù %d

source: invalid text mode %d
cs: chybný mód textu %d

source: Load from file...
cs: Naèti ze souboru...

source: Import MDL file...
cs: Import MDL souboru...

source: Export via BABEL...
cs: Exportuj (BABEL)...

source: Import PDB file...
cs: Import PDB souboru...

source: Add from file...
cs: Pøidej ze souboru...

source: Save as...
cs: Ulo¾ jako...

source: Nothing to save
cs: Nic k vrácení/obnovení

source: Writing to %s failed !
cs: Zápis do %s selhal !

source: Drawing saved in %s (%d bonds, %d labels)
cs: Vzorec ulo¾en jako %s (%d vazeb, %d popisek)

source: Writing to %s failed !
cs: Zápis do %s selhal !

source: Drawing exported as %s (%d bonds, %d labels)
cs: Vzorec exportován jako %s (%d vazeb, %d popisek)

source: Unable to open %s
cs: Nemohu otevøít %s

source: %s does not appear to be a Chemtool file
cs: %s nevypadá na soubor Chemtoolu

source: %s was created by a newer version. Some features may be lost.
cs: %s byl vytvoøen novìj¹í verzí . Nìkteré vlastnosti mohou být ztraceny.

source: Error loading %s
cs: Chyba naèítání %s

source: Choose orientation (Ctrl-Mouse1 for z), press Enter when done
cs: Vyber orientaci (Ctrl-Mouse1 pro z), poté stiskni Enter

source: Problems converting %s
cs: Problém s konverzí %s

source: Drawing saved in %s (%d bonds, %d labels)
cs: Vzorec ulo¾en jako %s (%d vazeb, %d popisek)

source: Click and drag the mouse to draw bonds on the canvas. The right mouse button is used to delete objects - either bonds or text depending on which drawing mode is active. The buttons with different ringtypes on them select drawing modes with preferred angles, but you can actually draw at any angle in all modes. The button with the segmented line on it lets you draw curves by marking control points along the curve (a cubic spline). You can select the bondtype and color using the appropriate button or change them later by clicking on the desired bond in Bonds mode. To draw a cyclic system, simply press the Ctrl key together with the number key corresponding to the number of sides for the polygon, and then draw one side while pressing the Ctrl button. For drawing labels, write them into the text box in the top right of the window and place them on the canvas with the mouse. You can also use a number of keyboard shortcuts for common labels while in bond drawing mode: Simply press the 'c' key, or n,o,p,s,f to add the element symbol at the current drawing position, 1,2 and 3 for CH, CH_2 and CH_3, l for Cl, * for a big dot. The keys of the numeric keypad each insert an 'electron pair' line around an atom symbol in the position corresponding to the location of the key around the center of the numeric keypad. The text mode uses the following prefixes for special text: _ for subscripts, ^ for superscripts, @ for symbols (greek characters), | for italic (slanted) characters and # for bold text. When the text box is empty, clicking on any label in the drawing area copies that label into the box for reuse. Drawing is best done with the mouse, but you can also use the cursor keys in combination with the Ctrl key for exact positioning. When used with the Alt key, the cursor keys move the rectangular or rhombic grid that can be projected on the drawing area. If you need general drawing functions not provided by chemtool, try exporting to fig format and editing your figure in Brian Smith's xfig program. Its companion transfig/fig2dev is required by chemtool for printing and for exporting to eps or LaTeX, while the fig, XBM and SVG output are generated directly. Another useful and highly recommended helper program is Babel - either in its original version, or in the form of the new OpenBabel project. Using either version, chemtool is able to import foreign data from a variety of file formats, while only molfile im- and export is built into chemtool. More help is available in the manual page for chemtool and in the file README included in the source distribution as well as on the website. This should normally get installed in /usr/share/doc/packages/chemtool. If you find any bugs or have a question or suggestion, please contact the main author, martin@ruby.chemie.uni-freiburg.de
cs: Kliknutím a tahem my¹i lze kreslit vazby. Pravé tlaèítko my¹i lze pou¾ít k vymazání objektu - vazeb, textu nebo celého výbìru, v závislosti na momentálnì aktivním kreslícím módu. Tlaèítka v li¹tì menu s rùznými typy kruhù vybírají kreslící mód s preferovanými úhly vazeb, ale obecnì je mo¾no pou¾ít libovolného úhlu v kterémkoliv zvoleném módu. Tlaèítko s dìlenou èárou volí vkládání kubických køivek, a to tak, ¾e umístíme ètyøi øídící body podél zamý¹lené køivky. Typ vazby a její barvu lze vybrat pou¾itím odpovídající pøedvolby v menu vazeb; zmìnu typu a barvy lze provést i dodateènì pøi stlaèeném tlaèítku 'Vazby'. Nakreslit cyklický systém najednou lze jednodu¹e stisknutím funkèní klávesy její¾ èíslo odpovídá poètu vazeb v kruhu a následným nakreslením jedné jeho vazby se souèasným podr¾ením tlaèítka Ctrl. Znaèky atomù a skupin je zapotøebí nejprve napsat do vstupního øádku textu v horní èásti okna aplikace a pak umístit do vzorce kliknutím my¹í. Ke vlo¾ení bì¾ných znaèek atomù lze pou¾ít klávesových zkratek pøímo v módu kreslení vazeb: jednodu¹e stisknutím klávesy 'c' nebo n,o,p,s,f,i,b,r,d,h vlo¾íme odpovídající symbol na konec právì nakreslené vazby; 1,2 a 3 vlo¾í CH, CH_2 a CH_3, l bude Cl a * bude tuèný puntík. Klávesy na numerické klávesnici vkládají elektronový pár, èárku kolem symbolu atomu na pozici odpovídající poloze klávesy okolo støedu numerické klávesnice. Textový mód pou¾ívá následujících pøedpon ke speciální modifikaci textu: _ pro index (subskript), ^ pro exponent (superskript), @ pro symboly (øecké znaky), | pro kurzívu (sklonìné písmo) a # pro tuèný text. Kliknutím prostøedním tlaèítkem my¹i po kterékoliv znaèce pou¾ité ve vzorci je tato zkopírována zpìt do vstupní linky k dal¹ímu pou¾ití. Kreslení se nejlépe provádí my¹í, av¹ak je také mo¾né pou¾ít kursorových kláves v kombinaci s klávesou Ctrl, zvlá¹tì pro pøesné umístìní. Pokud jsou kursorové klávesy pou¾ity v kombinaci s klávesou Alt, pohybují pravoúhlou nebo hexagonální møí¾kou, promítanou na kreslící plochu. Pokud potøebujete obecné kreslící funkce, které nejsou k dispozici v aplikaci Chemtool, exportujte vzorec do formátu .fig a dále editujte kresbu v programu Xfig pana Briana Smithe. Ten je doprovázen programem transfig/fig2dev, který je vy¾adován aplikací Chemtool k tisku a exportu do formátù eps nebo LaTeX (a emf), zatímco fig, XBM a SVG výstupy jsou generovány pøímo. Jiným u¾iteèným a doporuèeným programem je Babel, a to buï v pùvodní verzi nebo ve formì nového projektu OpenBabel. Pou¾itím kterékoliv z verzí Babelu je Chemtool schopen importovat cizí data z celé plejády formátù, zatímco zabudován je pouze import (a export) z formátu molfile. Výstup ve vektorovém formátu svg lze zobrazit ve webovém prohlí¾eèi (Adobe plug-in), tisknout a editovat programem Sodipodi nebo Javovou aplikací Batik Dal¹í informace jsou uvedeny v manuálových stránkách a v souboru README který je souèástí dokumentace distribuce, a také na webových stránkách projektu. Pokud narazíte na chybu v programu nebo budete mít dotazy èi návrhy, obra»te se, prosím, na hlavního autora na adrese martin@ruby.chemie.uni-freiburg.de

source: Chemtool Version 1.6.14 by Martin Kroeker, Radek Liboska, Michael Banck and Thomas Volk http://ruby.chemie.uni-freiburg.de/~martin/chemtool/chemtool.html
cs: Chemtool verze 1.6.14 napsali Martin Kroeker, Radek Liboska, Michael Banck a Thomas Volk http://ruby.chemie.uni-freiburg.de/~martin/chemtool/chemtool.html

source: PDB labels:
cs: Popisky PDB:

source: All
cs: V¹e

source: non-H
cs: bez H

source: no numbers
cs: bez èísel

source: non H,no numbers
cs: bez H, èísel

source: None
cs: ¾ádné

source: Latex / EPS scale factor :
cs: Latex / EPS faktor zvìt¹ení :

source: Unknown error
cs: Neznámá chyba

source: Configurable options
cs: Volby nastavení

source: _Background color:
cs: _Barva pozadí:

source: Add filled _white rectangle under labels
cs: Vkládej _bílé obdélníèky pod text

source: _Data directory:
cs: Adresáø _dokumentù:

source: E_xtension:
cs: _Pøípona:

source: Preview image to add to _EPS files:
cs: Náhledy vlo¾ené do _eps souborù:

source: Base bond _length:
cs: Základní délka _vazeb:

source: _Printing
cs: Tiskni

source: Portrait
cs: Nastojato

source: Landscape
cs: Nale¾ato

source: Print _command:
cs: Pøíkaz _tisku:

source: Printer _name:
cs: _Název tiskárny:

source: Paper si_ze:
cs: Ve_likost papíru

source: _Orientation:
cs: _Orientace:

source: Print sc_ale factor:
cs: ©kála tisku:

source: Select background color
cs: Barva pozadí:

source: Paper size:
cs: Velikost papíru

source: Orientation:
cs: Orientace:

source: Print scale factor :
cs: ©kála tisku:

source: Print command:
cs: Pøíkaz tisku:

source: Preview image to add to eps files :
cs: Náhledy vlo¾ené do eps souborù:

source: Background color :
cs: Barva pozadí:

source: Add filled white rectangle under labels
cs: Vkládej bílé obdélníèky pod text

source: Printer name:
cs: Název tiskárny:

source: Data directory:
cs: Adresáø dokumentù:

source: Extension:
cs: Pøípona:

source: Base bondlength (10.668mm) :
cs: Základní délka vazeb (10.668mm):

source: Cancel
cs: Zru¹it

source: Templates
cs: Templáty

source: Carbocycles
cs: Karbocykly

source: Sugars
cs: Cukry

source: Heterocycles
cs: Heterocykly

source: Symbols
cs: Symboly

source: Close
cs: Zavøi

source: New
cs: Nový

source: Open
cs: Otevøi

source: Add
cs: Pøidej

source: Import MOL
cs: Importuj MOL

source: Import PDB
cs: Importuj PDB

source: Import (Babel)
cs: Importuj (Babel)

source: Export...
cs: Exportuj...

source: Export (Babel)
cs: Exportuj (Babel)

source: Print
cs: Tiskni

source: Setup Defaults
cs: Nastavení

source: Save Config
cs: Ulo¾ nastavení

source: Save
cs: Ulo¾

source: Save As...
cs: Ulo¾ jako...

source: Quit
cs: ©mytec

source: File
cs: Soubor

source: Copy
cs: Kopíruj

source: Flip horizontally
cs: Pøeklop horizontálnì

source: Flip vertically
cs: Pøeklop vertikálnì

source: Undo
cs: Vra»

source: Redo
cs: Obnov

source: Edit
cs: Editace

source: Zoom in
cs: Zvìt¹i

source: Zoom out
cs: Zmen¹i

source: Center
cs: Vycentruj

source: Grid rect/rhomb/off
cs: Møí¾ka orto/hex/vypnuta

source: View
cs: Pohled

source: Templates...
cs: Templáty...

source: Calculate Formula Weight
cs: Vypoèti molekulovou hmotu

source: Clean up drawing
cs: Odstraò duplikáty

source: Tools
cs: Nástroje

source: About
cs: O programu

source: Help
cs: Nápovìda

source: Load
cs: Naèti

source: Load a chemtool sketch
cs: Naèti chemtool skeè

source: Add fragment from file
cs: Pøidej fragment ze souboru

source: Add template structure
cs: Pøidej templátovou strukturu

source: Save sketch to file
cs: Ulo¾ skeè do souboru

source: Create EPS, XFig, PicTeX or XBM file
cs: Vytvoø soubor EPS, XFig, PicTeX nebo XBM

source: Print file to a postscript printer
cs: Tiskni soubor na postscriptové tiskárnì

source: Setup default options
cs: Nastavení

source: Read a file written in MDL/molfile format
cs: Naèti soubor v MDL molfile formátu

source: Read a file written in PDB format
cs: Naèti soubor v PDB formátu

source: Zoom In
cs: Zvìt¹i

source: Increase zoom scale
cs: Zvìt¹i o stupeò

source: Center molecule in drawing area
cs: Vycentruj molekulu na kreslící plo¹e

source: Zoom Out
cs: Zmen¹i

source: Decrease zoom scale
cs: Zmen¹i o stupeò

source: Clear
cs: Èisti

source: Remove molecule
cs: Odstraò molekulu

source: FW
cs: MV

source: Calculate Formula Mass
cs: Vypoèti molekulovou hmotu

source: Exit Chemtool
cs: Ukonèi program

source: About Chemtool
cs: O programu Chemtool

source: Draw at 0/30/60/90 degree angles
cs: Kresli v 0/30/60/90 stupòových úhlech

source: Draw at 0/36/72/... degree angles
cs: Kresli v 0/36/72/... stupòových úhlech

source: Draw at 18/54/90/... degree angles
cs: Kresli v 18/54/90/... stupòových úhlech

source: Draw at 0/45/90... degree angles
cs: Kresli v 0/45/90... stupòových úhlech

source: Draw curves based on 4 control points
cs: Kresli køivky pomocí 4 øídících bodù

source: Draw left-justified text
cs: Pi¹ text zarovnaný vlevo

source: Draw centered text
cs: Pi¹ vycentrovaný text

source: Draw right-justified text
cs: Pi¹ text zarovnaný vpravo

source: Set current textfont
cs: Zmìò písmo (patky/bez patek)

source: Choose default bond type
cs: Vyber základní typ vazby

source: Select pen color
cs: Vyber barvu pera

source: Bonds
cs: Vazby

source: Toggle bond types
cs: Zmìò typ vazby

source: Mark objects for moving, rotating or deleting
cs: Oznaè objekty pro posun, rotaci nebo mazání

source: Move marked object
cs: Posuò oznaèený objekt

source: Rotate marked object
cs: Otoè oznaèený objekt

source: Flip object horizontally
cs: Pøeklop objekt horizontálnì

source: Flip object vertically
cs: Pøeklop objekt vertikálnì

source: Copy marked object
cs: Kopíruj oznaèený objekt

source: Rescale marked object
cs: ©káluj oznaèený objekt

source: Draw brackets around object
cs: Vlo¾ závorky kolem objektu

source: Draw rounded brackets around object
cs: Kresli kulaté závorky kolem objektu

source: Draw round brackets around object
cs: Kresli kulaté závorky kolem objektu

source: Draw braces around object
cs: Kresli slo¾ené závorky kolem objektu

source: Draw simple box around object
cs: Kresli jednoduchý rámeèek kolem objektu

source: Draw shaded box around object
cs: Kresli stínovaný rámeèek kolem objektu

source: Draw fancy box around object
cs: Kresli tuènì stínovaný rámeèek kolem objektu

source: Draw rounded box around object
cs: Kresli zakulacený rámeèek kolem objektu

source: Draw brackets and boxes around object
cs: Kresli závorky a rámeèky kolem objektu

source: Removes duplicate bonds, etc.
cs: Odstraò duplikáty atd.

source: Prefix a character with _ for subscript, ^ for superscript, @ for symbols, | for italic, # for bold text; e.g. H_2O, @a_D^2^0
cs: pøidejte pøed znak _ chcete-li vytvoøit index, ^ pro exponent, @ pro symbol, | pro sklonìné a # pro tuèné písmo; napø. H_2O, @b-èástice, @a_D^2^0

source: Select current text size
cs: Zmìò písmo (patky/bez patek)

source: Ready
cs: Hotovo

source: chemtool: can't load any font
cs: chemtool: nemohu naèist ¾ádé znaky

source: Memory allocation problem (SIGSEGV) -
cs: Problém s alokací pamìti (SIGSEGV) -

source: Invalid math somewhere (SIGFPE) -
cs: Matematická chyba (SIGFPE) -

source: Memory access problem (SIGBUS) -
cs: Problém pøístupu do pamìti (SIGBUS) -

source: Ordered to quit (SIGHUP) -
cs: Pøíkaz k ukonèení (SIGHUP) -

source: dumping current drawing to file crashdump.cht
cs: ukládám souèasný vzorec do souboru crashdump.cht

source: Looking in:
cs: Vyhledat v:

source: Directories
cs: Adresáøe

source: Mask:
cs: Maska:

source: Files
cs: Soubory

source: Directory unreadable: %s
cs: Adresáø nelze èíst: %s

source: Create Dir
cs: Vytvoøit adresáø

source: Delete File
cs: Smazat soubor

source: Rename File
cs: Pøejmenovat soubor

source: Error
cs: Chyba

source: Create Directory
cs: Vytvoøit adresáø

source: Directory name:
cs: Název adresáøe:

source: Create
cs: Vytvoøit

source: Delete
cs: Odstranit

source: Rename
cs: Pøejmenovat

source: Selection:
cs: Výbìr:

source: Consider installing Babel/OpenBabel for file format conversions...
cs: Pøedpokládám instalaci Babel/OpenBabel pro konverzi formátù souborù...

source: Benzene
cs: Benzen

source: Naphthalene
cs: Naftalen

source: Azulene
cs: Azulen

source: Adamantane
cs: Adamantan

source: Cyclohexane
cs: Cyklohexan

source: Steroid backbone
cs: Steroidní páteø

source: Cycloheptatriene
cs: Cykloheptatrien

source: Cyclooctatetraene
cs: Cyklooktatetraen

source: Fluorene
cs: Fluoren

source: Spiro[4.5]decane
cs: Spiro[4.5]decan

source: Heptalene
cs: Heptalen

source: Fulvalene
cs: Fulvalen

source: Dicyclopentadiene
cs: Dicyklopentadien

source: Indene
cs: Inden

source: Biphenyl
cs: Bifenyl

source: Norbornane
cs: Norbornan

source: Binaphthyl
cs: Binaftyl

source: Coronene
cs: Coronen

source: Pyranose core
cs: Pyranosový kruh

source: Furanose core
cs: Furanosový kruh

source: Ribofuranose
cs: Ribofuranosa

source: Fructose
cs: Fruktosa

source: Galactose
cs: Galaktosa

source: Glucose
cs: Glukosa

source: Mannose
cs: Mannosa

source: Fucose
cs: Fukosa

source: Xylose
cs: Xylosa

source: Neuraminic acid
cs: Neuramová kyselina

source: Sucrose
cs: Sacharosa

source: Maltose
cs: Maltosa

source: Lactose
cs: Lactosa

source: Adenine
cs: Adenin

source: Guanine
cs: Guanin

source: Thymine
cs: Thymin

source: Cytosine
cs: Cytosin

source: Porphine
cs: Porfyrin

source: Caffeine
cs: Kofein

source: Evans auxiliary
cs: Evans

source: SAMP auxiliary
cs: SAMP

source: Morphine
cs: Morfin

source: Morphine 3D
cs: Morfin 3D

source: rearrangement
cs: pøeskupení
